src/DataProcessors/ПереносМатериалаВ1С7/ПереносМатериалаВ1С7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносМатериалаВ1С7</name>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДанными</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Catalogs/ОсновныеЕдиницыИзмерений/ОсновныеЕдиницыИзмерений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеЕдиницыИзмерений</name>
  <comment>Основные единицы измерений</comment>
  <owners>Catalog.Материалы</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета количества</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПереносМатериалаВ1С7/Forms/Форма/Module.bsl
&НаКлиенте
Функция СоздатьПоследовательностьГрупп(V7,ТекРодитель)

ГруппаЭлемента = V7.CreateObject("Справочник."+ТекРодитель.Вид());

СписокГрупп.СортироватьПоПредставлению(НаправлениеСортировки.Убыв);
	Для каждого Стр Из СписокГрупп Цикл
	ГруппаЭлемента.ИспользоватьРодителя(ТекРодитель.ТекущийЭлемент());		
		Если ГруппаЭлемента.НайтиПоНаименованию(Стр.Значение,1,1) = 0 Тогда 
	    ГруппаЭлемента.НоваяГруппа();
	 	ГруппаЭлемента.Родитель = ТекРодитель.ТекущийЭлемент();
		ГруппаЭлемента.Наименование = Стр.Значение; 
		ГруппаЭлемента.Субсчет = V7.EvalExpr("СчетПоКоду("""+"10.1"+""")");		
		ГруппаЭлемента.Записать();
		КонецЕсли;
	ТекРодитель = ГруппаЭлемента.ТекущийЭлемент();	
	КонецЦикла;	
Возврат(ТекРодитель.ТекущийЭлемент());	
КонецФункции

&НаСервере
Функция ПолучитьПараметры()
Возврат(Новый Структура("Наименование,ПолнНаименование,Комментарий,ЕдиницаИзмерения,ОснЕИ",МПЗ.Наименование,МПЗ.ПолнНаименование,МПЗ.Комментарий,МПЗ.ЕдиницаИзмерения.Наименование,МПЗ.ОсновнаяЕдиницаИзмерения.Наименование));
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОснЕИ(ОснЕИ)
Возврат(Новый Структура("Наименование,ЕИ,Коэффициент",ОснЕИ.Наименование,ОснЕИ.ЕдиницаИзмерения.Наименование,ОснЕИ.Коэффициент));
КонецФункции

&НаСервере
Процедура ПолучитьСписокРодителей()
ТекГруппа = МПЗ.Родитель;
k = 1;
	Пока ЗначениеЗаполнено(ТекГруппа) Цикл
	СписокГрупп.Добавить(ТекГруппа.Наименование,k);
	ТекГруппа = ТекГруппа.Родитель;
	k = k + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОснЕИ()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ОсновныеЕдиницыИзмерений КАК ОсновныеЕдиницыИзмерений
	|ГДЕ
	|	ОсновныеЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ
	|	И ОсновныеЕдиницыИзмерений.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокОснЕИ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Возврат;
	КонецЕсли; 
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными(Объект.ОбменДанными);
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Перенос...");
Парам = ПолучитьПараметры();
ЭлементБазы = V7.CreateObject("Справочник.Материалы");
СпрЕд = V7.CreateObject("Справочник.ЕдиницыИзмерений"); 
СпрОснЕдНов = V7.CreateObject("Справочник.ЕдиницыМатериалов");

	Если ЭлементБазы.НайтиПоНаименованию(Парам.Наименование,0,1) = 1 Тогда
	Сообщить(Парам.Наименование+" - уже внесён в базу");
	Возврат;	
	КонецЕсли;

СписокГрупп.Очистить();
СписокОснЕИ.Очистить();
ПолучитьСписокРодителей(); 
ПолучитьСписокОснЕИ();  
ТекРод = СоздатьПоследовательностьГрупп(V7,V7.ПолучитьПустоеЗначение("Справочник.Материалы"));
ЭлементБазы.ИспользоватьРодителя(ТекРод.ТекущийЭлемент());
ЭлементБазы.ПорядокКодов();
ЭлементБазы.ОбратныйПорядок(1);
ЭлементБазы.ВыбратьЭлементы();
	Если ЭлементБазы.ПолучитьЭлемент() = 1 Тогда
	ТекКод = Число(ЭлементБазы.Код) + 1;
	Иначе	
	ТекКод = 1;
	КонецЕсли; 
ЭлементБазы.Новый();
ЭлементБазы.Код = ТекКод;
ЭлементБазы.Родитель = ТекРод.ТекущийЭлемент();
ЭлементБазы.Субсчет = V7.EvalExpr("СчетПоКоду("""+"10.1"+""")");
ЭлементБазы.Наименование = Парам.Наименование;
ЭлементБазы.ПолнНаименование = Парам.ПолнНаименование;
//ЭлементБазы.Статус = Парам.Статус;
ЭлементБазы.ДатаПрисвоения = ТекущаяДата();
ЭлементБазы.Комментарий = Парам.Комментарий;
СпрЕд.НайтиПоНаименованию(Парам.ЕдиницаИзмерения,0,1);
ЭлементБазы.ЕдиницаИзмерения = СпрЕд.ТекущийЭлемент();
//ЭлементБазы.ИмяФайла = ФайлЭлемента.ТекущийЭлемент();
ЭлементБазы.флИзменение = 1;
ЭлементБазы.Записать();
ЭлементБазы.СтавкаНДС.Установить(ТекущаяДата(),V7.Константа.ОсновнаяСтавкаНДС);
ЭлементБазы.СтавкаНП.Установить(ТекущаяДата(),V7.Константа.ОсновнаяСтавкаНП);
//ЭлементБазы.Стоимость.Установить(ТекущаяДата(),ТекЭлемент.Стоимость.Получить(РабочаяДата()));
//ЭлементБазы.Цена.Установить(ТекущаяДата(),ТекЭлемент.Цена.Получить(РабочаяДата()));   
	//Если ТекЭлемент.Статус > 0 Тогда
	//ЭлементБазы.Литера.Установить(РабочаяДата(),V7.Перечисление.СтатусыСпецификаций.ЗначениеПоНомеру(ТекЭлемент.Литера.Получить(РабочаяДата()).ПорядковыйНомер()));		
	//КонецЕсли;
	Для каждого ОснЕИ Из СписокОснЕИ Цикл
	ПарамОснЕИ = ПолучитьПараметрыОснЕИ(ОснЕИ.Значение);
	СпрОснЕдНов.Новый();
	СпрОснЕдНов.Владелец = ЭлементБазы.ТекущийЭлемент();
	СпрОснЕдНов.Наименование = ПарамОснЕИ.Наименование;
	СпрЕд.НайтиПоНаименованию(ПарамОснЕИ.ЕИ);
	СпрОснЕдНов.ЕдиницаИзмерения = СпрЕд.ТекущийЭлемент();
	СпрОснЕдНов.Коэффициент = ПарамОснЕИ.Коэффициент;
	СпрОснЕдНов.Записать();                                   
		Если СокрЛП(ПарамОснЕИ.Наименование) = СокрЛП(Парам.ОснЕИ) Тогда
		ЭлементБазы.ОсновнаяЕдиницаИзмерения = СпрОснЕдНов.ТекущийЭлемент();
		ЭлементБазы.Записать();	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
